<!DOCTYPE html>
<html lang="en">


<head>
    <title> Arlekyn &lt;HTML&gt;</title>
    <link rel="shortcut icon" href="assets/images/favicon.png" type="image/x-icon">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <meta name="description" content="">
    <meta name="author" content="">
    <link href="https://fonts.googleapis.com/css?family=Montserrat:100,200,300,400,500,600,700,800,900" rel="stylesheet">

    <!-- Bootstrap core CSS -->
    <link href="vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet">

    <!-- Additional CSS Files -->
    <link rel="stylesheet" href="assets/css/fontawesome.css">
    <link rel="stylesheet" href="assets/css/Arlekyn.css">
    <link rel="stylesheet" href="assets/css/owl.css">
    <link rel="stylesheet" href="assets/css/lightbox.css">
    <link rel="stylesheet" href="assets/css/Sidebars.css">

</head>


<body>

<!--header-->
<header class="main-header clearfix" role="header">
    <div class="logo">
        <a href="index.html"><em>Arlekyn</em> HTML</a>
    </div>
    <a href="#menu" class="menu-link"><i class="fa fa-bars"></i></a>
    <nav id="menu" class="main-nav" role="navigation">
        <ul class="main-menu">
            <li><a href="index.html">Главная</a></li>
            <li class="has-submenu"><a href="">Учеба</a>
                <ul class="sub-menu">
                    <li><a href="HTML.html">HTML</a></li>
                    <li><a href="CSS.html">CSS</a></li>
                    <li><a href="JS.html">JS</a></li>
                </ul>
            </li>
            <li><a href="Addition.html">Полезное</a></li>

        </ul>
    </nav>
</header>

<!--sidebar-->
<div class="area"></div><nav class="nain-menu">
    <ul>
        <li>
            <a href="#1">
                <i class="fa fa-forward" aria-hidden="true"></i>
                <span class="nav-text">
                           Введение в HTML
                        </span>
            </a>

        </li>
        <li class="has-subnav">
            <a href="#2">
                <i class="fa fa-play" aria-hidden="true"></i>
                <span class="nav-text">
                            Начало работы
                        </span>
            </a>


            </a>

        </li>
        <li class="has-subnav">
            <a href="#3">
                <i class="fa fa-play" aria-hidden="true"></i>
                <span class="nav-text">
                            Мультимедиа и встраивание
                        </span>
            </a>

        </li>
        <li>
            <a href="#4">
                <i class="fa fa-play" aria-hidden="true"></i>
                <span class="nav-text">
                             HTML таблицы
                        </span>
            </a>
        </li>
        <li>
            <a href="CSS.html">
                <i class="fa fa-play" aria-hidden="true"></i>
                <span class="nav-text">
                           Что такое CSS?
                        </span>
            </a>
        </li>
        <li>
            <a href="JS.html">
                <i class="fa fa-play" aria-hidden="true"></i>
                <span class="nav-text">
                            Что такое JS?
                        </span>
            </a>
        </li>


    </ul>

</nav>


<!-- ***** Main Banner Area Start ***** -->


<section class="section video" data-section="section5">
    <div class="container">
        <div class="row">
            <div class="col-md-6 align-self-center">
                <div class="left-content">
                    <span>Мы начинаем наш первый шаг</span>
                    <h4>Чтобы получить материал проще <em>открой видео справа</em></h4>
                    <h5> <em> Так что-же такое HTML?</em> <h5><h5> HTML не является языком программирования; это язык разметки, и используется, чтобы сообщать вашему браузеру, как отображать веб-страницы, которые вы посещаете.<h5>
                        <h5>Он может быть сложным или простым, в зависимости от того, как хочет веб-дизайнер. HTML состоит из ряда элементов, которые вы используете, чтобы вкладывать или оборачивать различные части контента, чтобы заставить контент отображаться или действовать определённым образом. Ограждающие теги могут сделать слово или изображение ссылкой на что-то ещё, могут сделать слова курсивом, сделать шрифт больше или меньше и так далее.
                            <a name="1"></a></h5>

                </div>
            </div>
            <div class="col-md-6">
                <article class="video-item">
                    <div class="video-caption">
                        <h4>HTML простыми словами</h4>
                    </div>
                    <figure>
                        <a href="https://www.youtube.com/watch?v=gNclCoxyIf8" class="play"><img src="assets/images/main-thumb.png"></a>
                    </figure>
                </article>
            </div>
        </div>
    </div>
</section>


<!-- ***** Введение в HTML ***** -->

<section class="section video" data-section="section5">
    <div class="container">
        <div class="row">

            <div class="left-content">
                <h4><em>Введение в HTML</em></h4>
                <h5> По сути, HTML довольно простой язык, состоящий из элементов, которые могут быть применены к частям текста, чтобы придавать им различные значения (Это абзац? Это маркированный список? Это часть таблицы?), разделять документ на логические секции (есть ли у документа шапка? три столбца с контентом? меню навигации?) и добавлять контент на Вашу страницу, такой как фото и видео. Этот модуль расскажет вам о первых двух возможностях HTML и научит фундаментальным концепциям и синтаксису, которые вам нужно знать, чтобы понять HTML.<h5>
                    <h5> <em> Необходимые условия:</em> <h5>
                        <h5>Чтобы начать изучение этого модуля, вам не нужны никакие знания HTML, но вы должны иметь хотя бы базовые навыки обращения с компьютером и навыки пассивного использования Веба (т.е просто смотря на него, потребляя контент). У вас должна быть базовая рабочая среда, описанная в разделе<a href=""> <em> Установка базового программного обеспечения</em> </a>, а также понимание, как создавать и управлять файлами, что подробно описано в статье.<h5>
                            <h4>Установка базового программного обеспечения  </h4>
                            <h5> <em>Какие инструменты используют профессионалы?</em> <h5>
                                <h5> - Компьютер. Может быть, это звучит очевидно для некоторых людей, но некоторые из вас читают эту статью с телефона или библиотечного компьютера. Для серьёзной веб-разработки, лучше приобрести настольный компьютер (Windows, Mac или Linux).<h5>
                                    <h5> - Текстовый редактор, чтобы писать код. Это может быть текстовый редактор (например, Visual Studio Code, Notepad++, Sublime Text, Atom, GNU Emacs, или VIM) или гибридный редактор (например, Dreamweaver or WebStorm). Офисные редакторы не подходят для этого, поскольку они зависят от скрытых элементов, которые мешают движкам рендеринга, используемым веб-браузерами.<h5>
                                        <h5>- Веб-браузеры, для тестирования кода. В настоящее время наиболее часто используемые браузеры это Firefox, Chrome, Opera, Safari, и Internet Explorer. Вы также должны тестировать ваш сайт на то, как он работает на мобильных устройствах и на любых старых браузерах, которые ваша целевая аудитория может все ещё широко использовать (например, IE 6-8). Lynx, текстовый веб-браузер для терминала, отлично подходит для того, чтобы увидеть, как ваш сайт воспринимается слабовидящими пользователями.<h5>
                                            <h5>- Графический редактор, такие как The Gimp, Paint.NET, или Photoshop, чтобы создавать изображения для ваших веб-страниц.<h5>
                                                <h5>- Система контроля версий, чтобы управлять файлами на сервере, для совместной работы над проектом с командой, обмениваться кодом и избегать редакторских конфликтов. Сейчас Git является наиболее популярным инструментом контроля версий, и репозиторий кода Github, основанный на Git, также является очень популярным.<h5>
                                                    <h5>- FTP программа, чтобы загружать веб-страницы на сервер для публичного просмотра. Существует обилие таких программ, доступных в том числе Cyberduck, Fetch, и FileZilla.<h5>
                                                        <h5>- Система автоматизации, такая как Grunt или Gulp, для автоматического выполнения повторяющихся задач, например, минимизации кода и запуска тестов.<h5>
                                                            <h5>- Шаблоны, библиотеки, фреймворки и т. д., чтобы ускорить написание общей функциональности.<h5>
                                                                <h4> Какие инструменты на самом деле нужны мне прямо <em> сейчас?</em></h4>
                <h5>Этот список выглядит страшновато, но, к счастью, вы можете начать веб-разработку, не зная ничего о большинстве из того, что в нем написано. В этой статье мы установим базовый минимум - текстовый редактор и некоторые современные веб-браузеры.<h5>
                    <h5><am>- Установка текстового редактора</am><h5>
                        <h5>Для веб-разработки вам, вероятно, понадобится больше, чем могут предложить Notepad или TextEdit. Мы рекомендуем начать с <a href="https://code.visualstudio.com/"target="_blank"> <em>Visual Studio Code</em></a>, который является бесплатным редактором, который предлагает предварительный просмотр и подсказки во время написания кода.<h5>
                        <h5><am>- Установка современных веб-браузеров</am><h5>
                            <h5>На данный момент, мы установим только пару настольных веб-браузеров, чтобы проверять наш код. Выберите вашу операционную систему ниже и нажмите на соответствующие ссылки для загрузки установочных программ ваших любимых браузеров:<h5>
                            <h5> <a href="https://www.mozilla.org/ru/firefox/new/"target="_blank"> <em>Firefox</em></a>;<h5>
                                <h5><a href="https://www.google.com/chrome/"target="_blank"><em> Chrome</em></a>;<h5>
                                    <h5><a href="https://www.opera.com/ru"target="_blank"><em>Opera</em></a>;<h5>
                                        <h5><a href="https://support.microsoft.com/ru-ru/windows"target="_blank"><em> Internet Explorer</em></a>.<h5>
                <h5>Прежде, чем идти дальше, вам следует установить, по крайней мере, два из этих браузеров, чтобы использовать их для тестирования<a name="2"></a>.<h5>

                    <!-- ***** Начало работы ***** -->

                    <section class="section video" data-section="section5">
                        <div class="container">
                            <div class="row">
                                <div class="col-md-6 align-self-center">
                                    <div class="left-content">
                                        <h4> <em><a name="2">Интерлюдия</a></em></h4>
                                        <h5> <em> Так что-же такое HTML?</em> <h5><h5> В этой статье мы охватим азы HTML, необходимые для начала работы. Дадим определение «элементам», «атрибутам», «тегам» и прочим важным понятиям, о которых вы, возможно, слышали, а также об их роли в языке. Мы также покажем, как устроены HTML-элементы, типичная HTML-страница, и объясним другие важные аспекты языка.<h5>

                                    </div>
                                </div>
                                <div class="col-md-6">
                                    <article class="video-item">
                                        <div class="video-caption">
                                            <h5> <vm>Начало работы с HTML</vm> </h5>
                                        </div>
                                        <figure>
                                            <a href="https://www.youtube.com/watch?v=4jYYHaTwWvY" class="play"><img src="assets/images/main-thumb.png"></a>
                                        </figure>
                                    </article>
                                </div>
                            </div>
                        </div>
                    </section>
                    <section class="section video" data-section="section5">
                        <div class="container">
                            <div class="row">

                                <div class="left-content">
                                    <h4><em>Начало работы с HTML</em></h4>
                                    <h5> <em> Так что-же такое HTML?</em> <h5><h5> Элемент head HTML-документа не отображается на странице в веб-браузере. Он содержит такую информацию, как:<h5>

                                        <h5>- заголовок (title) страницы<h5>
                                            <h5>- ссылки на файлы CSS (если вы хотите применить к вашему HTML стили CSS)<h5>
                                                <h5>- ссылки на иконки<h5>
                                                    <h5>- другие метаданные (данные о HTML: автор и важные ключевые слова, описывающие документ.)<h5>
                                                        <h5>Элемент head HTML-документа не отображается на странице в веб-браузере. Он содержит такую информацию, как:

                                                            заголовок (title) страницы
                                                            ссылки на файлы CSS (если вы хотите применить к вашему HTML стили CSS)
                                                            ссылки на иконки
                                                            другие метаданные (данные о HTML: автор и важные ключевые слова, описывающие документ.)
                                                        </h5>
                                                        <h5> Встроенные тэги могут преобразовать часть содержимого в гиперссылку, по которой можно перейти на другую веб-страницу, выделить курсивом слова и так далее. Например, рассмотрим следующую строку:<h5>
                                                            <h6>Мой кот очень сердитый<h6>
                                                                <h5><pm>Если мы хотим, чтобы строка отобразилась в таком же виде, мы можем определить её, как "параграф", заключив её в теги элемента "параграф" (<р>), например: </pm><h5>
                                                                    <code><р>Мой кот очень сердитый<р></code>
                                                                        <h5>Давайте рассмотрим элемент "параграф" чуть подробнее:<h5>
                                                                            <img src="assets/images/Start1.png"style="padding: 10px;">
                                                                            <h5>Основными частями элемента являются:<h5>
                                                                                <h5><am>- Открывающий тег:</am> Он состоит из названия (обозначения) элемента (в нашем случае, p), помещённого внутри <am>угловых скобок</am>. Данный тег служит признаком начала элемента, с этого момента тег начинает влиять на следующее после него содержимое.<h5>
                                                                                    <h5><am>- Закрывающий тег:</am> выглядит как и открывающий, но содержит слеш перед названием тега. Он служит признаком конца элемента. Пропуски закрывающих тегов — типичная ошибка новичков, которая может приводить к неопределённым результатам — в лучшем случае всё сработает правильно, в других страница может вовсе не прорисоваться или прорисоваться не как ожидалось.<h5>
                                                                                        <h5><am>- Содержимое:</am> Как видно, в нашем случае содержимым является простой текст.<h5>
                                                                                            <h5><am>- Элемент:</am> открывающий тег + закрывающий тег + содержимое = элемент.<h5>
                                </div>

                            </div>
                        </div>
                    </section>

                    <section class="section video" data-section="section5">
                        <div class="container">
                            <div class="row">
                                <div class="col-md-6 align-self-center">
                                    <div class="left-content">
                                        <h4> <em><a name="2">Виды элементов</a></em></h4>
                                        <h5> -<am> Вложенные элементы</am><h5>
                                            <h5>Вы также можете вкладывать элементы внутрь других элементов — это называется вложенностью. Если мы хотим подчеркнуть, что наш кот очень сердитый, мы можем заключить слово "очень" в элемент < strоng> , который означает, что это слово крайне важно в данном контексте.<h5>
                                            <h5> -<am> Блочные элементы</am><h5>
                                                <h5>Элементы блочного уровня формируют видимый блок на странице — они окажутся на новой строке после любого контента, который шёл до них, и любой контент после них также окажется на новой строке. Чаще всего элементами блочного уровня бывают структурные элементы страницы, представляющие собой, например, параграфы (абзацы), списки, меню навигации, футеры, или подвалы, и т. п. Элементы блочного уровня не вкладываются в строчные элементы, но иногда могут вкладываться в другие элементы блочного уровня.<h5>
                                                <h5> -<am> Строчные элементы</am><h5>
                                                    <h5>Строчные элементы — это те, которые содержатся в элементах блочного уровня и окружают только малые части содержимого документа, не целые абзацы и группировки контента. Строчные элементы не приводят к появлению новой строки в документе: они обычно встречаются внутри абзаца текста.<h5>



                                    </div>
                                </div>
                                <div class="col-md-6">
                                    <article class="video-item">
                                        <div class="video-caption">
                                            <h5> <vm>Виды элементов HTML</vm> </h5>
                                        </div>
                                        <figure>
                                            <a href="https://www.youtube.com/watch?v=bBnqtbIKmZI" class="play"><img src="assets/images/main-thumb.png"></a>
                                        </figure>
                                    </article>
                                </div>
                            </div>
                        </div>
                        <div class="container">
                            <div class="row">
                                <div class="left-content">
                                        <h4> <pm>Пустые элементы</pm></h4>
                                        <h5> Не все элементы соответствуют вышеупомянутому шаблону: открывающий тег, контент, закрывающий тег. Некоторые элементы состоят из одного тега и обычно используются для вставки чего-либо в то место документа, где размещены. Например, элемент <>img вставляет картинку на страницу в том самом месте, где он расположен:<h5>
                                            <h5>Это выведет на вашу страницу следующее:<h5>
                                                <img src="assets/images/Start2.png"style="padding: 10px;">
                                                <h4> <pm>Пустые элементы</pm></h4>
                                                <h5>У элементов также могут быть атрибуты, которые выглядят так:<h5>
                                                    <img src="assets/images/Start3.png"style="padding: 10px;width: 80%">
                                                    <h5>Атрибуты содержат дополнительную информацию об элементе, которая, по вашему мнению, не должна отображаться в содержимом элемента. В данном случае атрибут <am>class</am> позволяет вам дать элементу идентификационное имя, которое в дальнейшем может быть использовано для обращения к элементу с информацией о стиле и прочими вещами.<h5>
                                                        <h5><am>Атрибут должен иметь:</am><h5>
                                                            <h5>1. Пробел между атрибутом и именем элемента (или предыдущим атрибутом, если у элемента уже есть один или несколько атрибутов).<h5>
                                                                <h5>2. Имя атрибута и следующий за ним знак равенства.<h5>
                                                                    <h5>3. Значение атрибута, заключённое в кавычки.<h5>
                                                                        <h4><am>Структура HTML документа</am></h4>
                                                                        <h5>Ниже дан пример оборачивания основных, самостоятельных HTML-элементов, которые сами по себе не очень полезны. Давайте посмотрим, как самостоятельные элементы объединяются для формирования всей HTML страницы:<h5>
                                                                            <img src="assets/images/Start4.png"style="padding: 10px;">
                                                                            <h5>Вот что мы имеем:</h5>
                                                                                <h5>1. <am> &lt;!DOCTYPE html></am>: Объявление типа документа. Очень давно, ещё когда HTML был молод (1991/2), типы документов использовались в качестве ссылок на набор правил, которым HTML-страница должна была следовать, чтобы она считалась хорошей, что может означать автоматическую проверку ошибок и другие полезные вещи. Объявление типа документа выглядело примерно вот так:</h5>
                                                                                    <img src="assets/images/Start5.png"style="padding: 10px;">  <h5>Однако в наши дни никто особо не думает о них, и типы документа стали историческим артефактом, которые должны быть включены везде, чтобы всё работало правильно. <"!DOCTYPE html"> — это самый короткий вид типа документа, который считается действующим. На самом деле это всё, что нужно вам знать о типах документов.<h5>
                                                                            <h5>2. <am>&lt;html>&lt;/html></am>: Элемент <'html'> содержит в себе всё содержимое на всей странице, и иногда его называют "корневой элемент".<h5>
                                                                                <h5>3. <am>&lt;head>&lt;/head></am>: Элемент <'head'>. Данный элемент выступает в качестве контейнера для всего содержимого, которое вы хотите включить в HTML документ, но не хотите показывать посетителям вашей страницы. Он включает такие вещи, как ключевые слова и описание страницы, которые вы хотели бы показывать в поисковых запросах, CSS для стилизирования вашего контента, объявление поддерживаемого набора символов и многое другое. Вы узнаете больше об этом из следующей статьи данного руководства.<h5>
                                                                                    <h5>4.<am> &lt;meta charset="utf-8"></am>: Этот элемент устанавливает в качестве символьной кодировки для вашего документа utf-8 , который включает большинство символов из всех известных человечеству языков. По существу, теперь страница сможет отобразить любой текстовый контент, который вы сможете в неё вложить. Нет причин не устанавливать эту кодировку, это также позволит избежать некоторых проблем позднее.</am><h5>
                                                                                        <h5>5. <am>&lt;title>&lt;/title></am>: Элемент <'title'>. Этот элемент устанавливает заголовок вашей страницы, который появляется во вкладке браузера, загружающей эту страницу, также это заглавие используется при описании страницы, когда вы сохраняете её в закладках или избранном.<h5>
                                                                                            <h5>6. <am>&lt;body>&lt;/body></am>: Элемент <'body'>. Он содержит весь контент, который вы хотите показывать посетителям вашей страницы, — текст, изображения, видео, игры, проигрываемые аудио дорожки или что-то ещё.<h5>
                                                                                                <h4><pm>Активное изучение: Добавление элементов в ваш HTML-документ</pm><h4>
                                                                                                    <h5>Если вы хотите поэкспериментировать с написанием HTML на своём компьютере, то можете:<h5>
                                                                                                        <h5>1.Скопировать пример HTML-страницы, расположенный выше.<h5>
                                                                                                            <h5>2.Создать новый файл в текстовом редакторе.<h5>
                                                                                                                <h5>3.Вставить код в ваш новый текстовый файл.<h5>
                                                                                                                    <h5>4.Сохранить файл как index.html.<h5>
                                                                                                                        <h5>Теперь можете открыть браузер и посмотреть, во что отрисовался код, а потом изменить его, обновить страницу и посмотреть, что получилось. Сначала страница выглядит так:<h5>
                                                                                                                            <img src="assets/images/Start6.png"style="padding: 10px;">
                                                                                                                            <h5>Для этого упражнения вы можете редактировать код локально на своём компьютере, как предлагается выше, а можете работать в редакторе, расположенном ниже. В редакторе показано только содержимое элемента <am>&lt;body></am>. Попробуйте сделать следующее:<h5>
                                                                        <h5>Добавьте заголовок страницы сразу за открывающим тегом <am>&lt;body></am>. Текст должен находиться между открывающим тегом <am>&lt;h1></am> и закрывающим <am>&lt;h1></am> .<h5>
                                                                            <h5>Напишите в параграфе о чём-нибудь, что кажется вам интересным.<h5>
                                                                                <h5>Выделите важные слова, обернув их в открывающий тег &lt;strong> и закрывающий &lt;/strong><h5>
                                                                                    <h5>Добавьте изображение в свой документ под абзацем, как объяснено ранее в статье. Если сможете использовать другую картинку (со своего компьютера или из интернета). Вы большой молодец!<h5>
                                                                                        <h4><pm>Что внутри "head"? Метаданные в HTML</pm></h4>
                                                                                        <h5>Элемент head HTML-документа не отображается на странице в веб-браузере. Он содержит такую информацию, как:<h5>
                                                                                            <h5>- <am>заголовок (title) страницы</am><h5>
                                                                                                <h5>- <am>ссылки на файлы CSS</am> (если вы хотите применить к вашему HTML стили CSS)<h5>
                                                                                                    <h5>- <am>ссылки на иконки</am><h5>
                                                                                                        <h5>- <am>другие метаданные</am> (данные о HTML: автор и важные ключевые слова, описывающие документ.)<h5>

                                                                                        <div class="col-md-6">
                                                                                            <article class="video-item">
                                                                                                <div class="video-caption">
                                                                                                    <h5> <vm>Что внутри &lt;head>?</vm> </h5>
                                                                                                </div>
                                                                                                <figure>

                                                                                                    <a href="https://www.youtube.com/watch?v=ks1cAub9PGs" class="play"><img src="assets/images/TV.png"></a>
                                                                                                </figure>
                                                                                            </article>
                                                                                        </div>
                                                                                                            <h5>Чтобы понять, что находиться внутри данного блока, предлагаем вам ознакомиться с видеоматериалом выше!<h5>
                                                                                                            <h4><pm>Основы редактирования текста в HTML</pm></h4>
                                                                                                                <h5>Одна из основных задач HTML — придавать тексту структуру и смысл, семантику, так, чтобы браузер смог отобразить текст корректно. Эта статья покажет, как можно использовать HTML, чтобы упорядочить текст на странице путём добавления заголовков и абзацев, выделения слов, создания списков и многое другое.<h5>
                                                                                                                    <h5>В HTML каждый абзац заключён в элемент <am>&lt;p></am>, каждый заголовок заключён в элемент заголовка <am>&lt;h1></am>, Имеется шесть элементов заголовка: <am>&lt;h1></am> (en-US), <am>&lt;h2></am> (en-US), <am>&lt;h3></am> (en-US), <am>&lt;h4></am> (en-US), <am>&lt;h5></am> (en-US) и <am>&lt;h6></am> (en-US). Каждый элемент представляет разный уровень контента в документе;<h5> <h1> представляет главный заголовок,<h1> <h2> представляет подзаголовки,<h2> <h3 style="padding-bottom: 20px"> представляет под-подзаголовки и так далее.<h3>
                                                                                                                        <h5>Всё это действительно зависит от вас — что именно будут представлять собой элементы, пока существует иерархия. Вам просто нужно иметь в виду несколько хороших правил при создании таких структур.<h5>
                                                                                                                            <h5>- Предпочтительнее использовать <am>&lt;h1></am> только один раз на странице — это заголовок самого верхнего уровня, и все остальные заголовки располагаются ниже его в иерархии.<h5>
                                                                                                                                <h5>- Убедитесь, что вы используете заголовки в правильном порядке в иерархии. Не используйте <am>&lt;h3></am> для создания подзаголовков при одновременном использовании <am>&lt;h2></am> для представления под-подзаголовков — это не имеет смысла и приведёт к странным результатам.<h5>
                                                                                                                                    <h5>- Из шести доступных уровней заголовка вы должны стремиться использовать не более трёх на странице, если только вы не чувствуете, что это необходимо. Документы с большим количеством уровней (то есть с глубокой иерархией) становятся громоздкими и трудными для навигации. В таких случаях рекомендуется распределять контент по нескольким страницам, если это возможно.<h5>

                                                                                                                                        <h4><pm>Создание гиперссылок</pm></h4>
                                                                                                                                        <div class="col-md-6">
                                                                                                                                            <article class="video-item">
                                                                                                                                                <div class="video-caption">
                                                                                                                                                    <h5> <vm>Что такое гиперссылка?</vm> </h5>
                                                                                                                                                </div>
                                                                                                                                                <figure>

                                                                                                                                                    <a href="https://www.youtube.com/watch?v=xK04R0-v_xA" class="play"><img src="assets/images/TV.png"></a>
                                                                                                                                                </figure>
                                                                                                                                            </article>
                                                                                                                                        </div>
                                                                                                                                        <h5>Гиперссылки действительно важны — они делают Интернет Интернетом. В этой статье представлен синтаксис, необходимый для создания ссылки, а также обсуждаются лучшие практики обращения со ссылками.Гиперссылки — одно из самых интересных нововведений Интернета. Они были особенностью Сети с самого начала, но именно они превращают Интернет в Интернет. Они позволяют нам связывать наши документы с любым другим документом (или ресурсом), с которым мы хотим. С их помощью мы также можем связывать документы с их конкретными частями, и мы можем сделать приложения доступными на простом веб-адресе (сравните это с локальными приложениями, которые должны быть установлены, и другими такими же вещами). Почти любой веб-контент может быть преобразован в ссылку, так что когда вы кликаете по ней (или иным образом активируете), она заставляет веб-браузер перейти на другой веб-адрес (URL.)<h5>
                                                                                                                                            <h4><pm>Структура документа и веб-сайта</pm></h4>
                                                                                                                                            <h5>В дополнение к определению отдельных частей вашей страницы (таких как «абзац» или «изображение»), HTML также содержит ряд элементов блочного уровня, используемых для определения областей вашего веб-сайта (такие как «заголовок», «навигационное меню», «колонка основного содержимого»). В этой статье рассматривается, как планировать базовую структуру сайта и писать HTML для представления этой структуры.<h5>
                                                                                                                                                <h5>Основные составляющие документа:<h5>
                                                                                                                                                    <h5><am>- Заголовок (колонтитул)</am><h5>
                                                                                                                                                        <h5>Обычно это большая полоса вверху страницы, с крупным заголовком и / или логотипом. Здесь указывается общая информация о веб-сайте, не меняющаяся от страницы к странице.<h5>
                                                                                                                                                            <h5><am>- Навигационное меню</am><h5>
                                                                                                                                                                <h5>Ссылки на основные разделы сайта; обычно в виде кнопок, ссылок или вкладок. Также как и заголовок, навигация остаётся неизменной на всех страницах сайта — наличие непоследовательной навигации на вашем сайте запутает и разочарует пользователей. Многие веб-дизайнеры считают панель навигации частью заголовка, а не отдельным компонентом, но это не является обязательным требованием; на самом деле, некоторые также утверждают, что их разделение на отдельные компоненты улучшает доступность, поскольку раздельная структура будет понятнее для людей, пользующихся считывателями экрана.<h5>
                                                                                                                                                                    <h5><am>- Основное содержимое</am><h5>
                                                                                                                                                                        <h5>Большая область в центре страницы, содержащая, в основном, уникальный контент данной веб-страницы, например видео, которое вы хотите посмотреть, или рассказ, который вы читаете, или карту, которую вы хотите просмотреть, или заголовки новостей и т. д. Это одна из частей сайта, которая определённо будет меняться от страницы к странице!<h5>
                                                                                                                                                                            <h5><am>- Боковая панель</am><h5>
                                                                                                                                                                                <h5>Как правило, содержит некоторую второстепенную информацию, ссылки, цитаты, рекламу и т.д. Обычно она относится к содержимому в основном контенте (например, на странице со статьёй, боковая панель может содержать биографию автора или ссылки на связанные статьи), но в некоторых случаях здесь размещают и другие элементы, например, вторичную навигационную систему.<h5>
                                                                                                                                                                                    <h5><am>- Нижний колонтитул (футер)</am><h5>
                                                                                                                                                                                        <h5>Полоса в нижней части страницы, которая обычно содержит уведомления об авторских правах или контактную информацию. Это место для размещения общей информации (например, заголовка), но обычно эта информация не является критичной или вторична для самого веб-сайта. Нижний колонтитул также иногда используется для SEO целей, предоставляя ссылки для быстрого доступа к популярному контенту.<h5>
                                                                                                                                                                                            <h5>"Типичный веб-сайт" может быть структурирован примерно так:<h5>
                                                                                                                                                                                                <img src="assets/images/start7.png">


                                                                                        <h4><pm>Подведение итогов</pm></h4>
                                                                                        <h5>Вы дошли до конца статьи — надеемся, вам понравилось путешествие по основам HTML. На этом этапе вы уже должны немного разобраться, как выглядит язык, как он работает на базовом уровне и уметь описать несколько элементов и атрибутов. Сейчас идеальное время и место, чтобы продолжить изучать HTML. В последующих статьях мы рассмотрим некоторые из вещей, которые вы уже рассмотрели, но намного подробнее, а также представим некоторые новые функции языка. Оставайтесь с нами<a name="3"></a>!<h5>
                                </div>
                            </div>
                        </div>
                    </section>


                    <!-- ***** Мультимедиа и встраивание ***** -->


                    <section class="section video" data-section="section5">
                        <div class="container">
                            <div class="row">
                                <div class="col-md-6 align-self-center">
                                    <div class="left-content">
                                        <h4> <em>Мультимедиа и встраивание</em></h4>
                                        <h5> Мы уже прочли много текста в этом курсе. МНОГО текста. Но веб был бы скучным, если бы состоял только из текста, поэтому давайте посмотрим, как оживить веб при помощи более интересного контента! Этот модуль объясняет, как при помощи HTML вставлять мультимедиа в ваши web-страницы, включая разные способы вставки изображений, видео, аудио, а также других страниц целиком.<h5>
                                    </div>
                                </div>
                                <div class="col-md-6">
                                    <article class="video-item">
                                        <div class="video-caption">
                                            <h5> <vm>Коротко о материале</vm> </h5>
                                        </div>
                                        <figure>
                                            <a href="https://www.youtube.com/watch?v=B0WB7BOWIyg" class="play"><img src="assets/images/main-thumb.png"></a>
                                        </figure>
                                    </article>
                                </div>
                            </div>
                        </div>
                    </section>
                    <section class="section video" data-section="section5">
                        <div class="container">
                            <div class="row">
                                <div class="left-content">
                                    <h4><pm>Изображения в HTML</pm></h4>
                                    <h5> В начале Web был просто текстом, что было довольно скучно. К счастью, это продолжалось не долго - до появления возможности вставлять изображения (и другие, более интересные, типы контента) в веб-страницы. Существуют и другие типы мультимедиа, однако логичнее начать со скромного <am>&lt;img></am> элемента, используемого для вставки простого изображения в веб-страницу. В этой статье мы рассмотрим, как использовать элемент, начиная с основ, снабжать примечаниями, используя <am>&lt;figure></am>, и разберём, как это относится к фоновым изображениям CSS.<h5>
                                        <h4><pm>Как разместить картинку на странице?</pm></h4>
                                        <h5>Чтобы разместить изображение на странице, нужно использовать тег <am>&lt;img></am>. Это пустой элемент (имеется ввиду, что не содержит текста и закрывающего тега), который требует минимум один атрибут для использования — <am>src</am> (произносится эс-ар-си, иногда говорят его полное название, source). Атрибут <am>src</am> содержит путь к изображению, которое вы хотите встроить в страницу, и может быть относительным или абсолютным URL, точно так же, как значения атрибута <am>href</am> для элемента <a>.<h5>
                                            <h5>Например, если ваше изображение называется <am>dinosaur.jpg</am>, и оно находится в той же директории что и ваша HTML страница, вы можете встроить это изображение как:<h5>
                                                <code> &lt;img src="dinosaur.jpg"></code>
                                                <h5>Если изображение было в поддиректории <am>images</am> , находящаяся внутри той же директории, что и HTML страница (что рекомендует Google для индексации и целей SEO), тогда вы можете встроить его так:<h5>
                                                    <code> &lt;img src="images/dinosaur.jpg"></code>
                                                    <h5>Вы можете встроить изображение используя абсолютный URL, например:<h5>
                                                        <code> &lt;img src="https://www.example.com/images/dinosaur.jpg"></code>
                                                        <h5>Но это бессмысленно, так как он просто заставляет браузер делать больше работы, запрашивая каждый раз IP-адрес от DNS-сервера. Вы почти всегда будете держать свои изображения для сайта на том же сервере, что и ваш HTML.<h5>
                                                            <h5>Как и для ссылок, вы также можете добавить атрибут <am>title</am> для изображений, чтобы при необходимости предоставить дополнительную информацию. Это даёт нам всплывающую подсказку при наведении курсора мыши.<h5>
                                                                <h4><pm>Придание изображению структуры и установка заголовка</pm></h4>
                                                                <h5>Лучшим решением будет использование элементов HTML5 <figure> и <figcaption>. Они были созданы исключительно для этой цели: предоставить семантический контейнер для рисунков и чётко связать рисунок с заголовком. <h5>
                                                                    <h5>Элемент <am>&lt;figcaption></am> говорит браузерам и вспомогательной технологии, что заголовок описывает содержимое элемента <am>&lt;figure></am>.<h5>
                                                                        <h5>Тег <figure> не является изображением. Он представляет собой независимый структурный элемент, который:<h5>
                                                                            <h5>- Передаёт смысл компактным, интуитивно понятным способом.<h5>
                                                                                <h5>- Может использоваться в различных местах страницы.<h5>
                                                                                    <h5>- Предоставляет ценную информацию, поддерживающую основной текст.<h5>
                                                                                        <h5>Тег <am>&lt;figure></am> может быть несколькими изображениями, куском кода, аудио, видео, уравнением, таблицей, либо чем-то другим.<h5>
                                                                                            <h4><pm>Фоновые изображения CSS</pm></h4>
                                                                                            <h5>Вы можете использовать CSS для встраивания изображений в веб-страницы (или JavaScript, но это совсем другая история). Параметры CSS <am>background-image</am> и другие <am>background-*</am> применяются для контроля размещения фонового изображения. К примеру, чтобы залить фон каждого параграфа страницы, необходимо сделать следующее:<h5>
                                                                                                <code> background-image: url("images/dinosaur.jpg");</code>
                                                                                                <h5>Получившееся в конечном итоге изображение можно легко позиционировать и контролировать, в отличие от его HTML аналога. Так зачем же возиться с HTML изображениями? Как указано выше, фоновые изображения CSS предназначены только для украшения. Если вы просто хотите добавить что-то красивое на свою страницу, чтобы улучшить визуальные эффекты, это нормально. Тем не менее, такого рода изображения не имеют семантического смысла вообще. Они не могут иметь каких-то текстовых эквивалентов, видимых посетителю, они невидимы для программ чтения с экрана. Вот где блистают HTML-изображения!<h5>
                                                                                                    <h4><pm>Видео и аудио контент</pm></h4>
                                                                                                    <h5>Теперь, когда мы спокойно добавляем простые изображения на веб-страницу, сделаем следующий шаг — начнём добавлять видео и аудиоплееры в ваши HTML-документы! В этой статье вы увидите, как это делать с элементами <am>&lt;video></am> и <am>&lt;audio></am> ; а в завершение посмотрите, как добавить титры и субтитры к вашим видео.<h5>
                                                                                                        <h4><pm>Аудио и видео в Интернете</pm></h4>
                                                                                                        <h5>Веб-разработчики хотели использовать видео и аудио в Интернете в течение длительного времени, начиная с начала 2000-х годов, когда пропускная способность сети стала достаточной, чтобы поддерживать любое видео (видеофайлы намного больше, чем текст, или даже изображения). На раннем этапе базовые веб-технологии, такие как HTML, не имели возможности размещения на сайтах видео и аудио контента, поэтому запатентованные технологии (или плагины), такие как Flash (а затем и Silverlight), стали популярными для обработки такого контента. Эти технологии работали нормально, но у них было много недостатков, в числе которых плохая поддержка возможностей HTML и CSS, проблемы безопасности и проблемы доступности.
                                                                                                            Собственное решение устранило бы большую часть этой проблемы, если бы оно было реализовано правильно. К счастью, несколько лет спустя в спецификации HTML5 были добавлены такие функции, с элементами <am>&lt;video></am> и <am>&lt;audio></am>, и некоторые новые JavaScript API для их управления. Мы не будем рассматривать JavaScript здесь - только необходимые основы, которые могут быть достигнуты с помощью HTML.
                                                                                                                Мы не будем учить вас, как создавать аудио и видеофайлы - для этого требуется совершенно другой набор навыков. Мы предоставили вам образцы аудио и видеофайлов и пример кода для вашего собственного эксперимента, на случай, если у вас нет под рукой собственных.<h5>
                                                                                                                <h5>Элемент <am>&lt;video></am> позволяет вам вставлять видео достаточно легко. Очень простой пример выглядит так:<h5>
                                                                                                                    <code>&lt;video src="rabbit320.webm" controls>&lt;/video></code>
                                                                                                                    <h5>Элемент <am>&lt;audio></am>работает точно так же, как элемент <am>&lt;video></am>, с несколькими небольшими отличиями, которые описаны ниже.<h5>
                                                                                                                        <h4><pm>От &lt;object> к &lt;iframe> - другие технологии внедрения</pm></h4>
                                                                                                                        <h5>Краткая история внедрения<h5>
                                                                                                                            <h5>Давным-давно в Интернете было популярно использовать фреймы для создания веб-сайтов - небольших частей веб-сайта, хранящихся на отдельных страницах HTML. Они были встроены в главный документ, называемый набором фреймов, который позволял вам указать область на экране, которую заполнял каждый фрейм, а не столбец и строку таблицы. Они были популярны в середине и конце 90-х годов и были доказательством того, что разделение веб-страницы на более мелкие куски лучше сказывается на скорости загрузки, особенно это заметно, когда сетевые соединения были медленными. Однако у них было много проблем, которые намного перевешивали любые положительные моменты, когда скорость сети становилась выше. Поэтому вы больше не увидите, чтобы их использовали.<h5>
                                                                                                                                <h5>Спустя некоторое время (конец 90-х, начало 2000-х годов) технологии плагинов, такие как Java-апплеты и Flash, стали очень популярными - это позволило веб-разработчикам встраивать богатый контент в веб-страницы, такие как видео и анимации, которые просто не были доступны только через HTML. Внедрение этих технологий осуществлялось посредством таких элементов, как &lt;object> (en-US) и менее используемого &lt;embed>, и они были очень полезны в то время. С тех пор они вышли из моды из-за многих проблем, включая доступность, безопасность, размер файла и многое другое; в наши дни большинство мобильных устройств больше не поддерживают такие плагины, и поддержка на компьютерах также уменьшается.<h5>
                                                                                                                                    <h5>Наконец, появился элемент &lt;iframe> (en-US) (наряду с другими способами встраивания контента, например &lt;canvas>, &lt;video> и т. д. ) Он позволяет встраивать целый веб-документ внутри другого, как если бы это был &lt;img> или другой подобный элемент, и сегодня используется повсеместно.<h5>
                                                                                                                                        <h5>Это так же подводит нас к окончанию целого модуля "Мультимедиа и встраивание"! Единственное, что вам осталось сейчас сделать перед тем, как двигаться дальше - это попробовать наше мультимедийное задание и посмотреть, как вы усвоили материал. Веселитесь<a name="4"></a>!<h5>
                                </div>
                            </div>
                        </div>
                    </section>

                    <!-- ***** HTML таблицы ***** -->


                    <section class="section video" data-section="section5">
                        <div class="container">
                            <div class="row">
                                <div class="col-md-6 align-self-center">
                                    <div class="left-content">
                                        <h4> <em>HTML таблицы</em></h4>
                                        <h5> Структурирование табличных данных является в HTML самой обычной задачей, для этой цели есть множество элементов и атрибутов. С добавлением таблиц стилей (CSS) HTML с лёгкостью позволяет выводить в веб различные таблицы, например, расписание школьных уроков, график посещения бассейна, или статистические данные о ваших любимых динозаврах или футбольных командах. В данном разделе вы узнаете все, что вам потребуется для структурирования табличных данных с помощью HTML.<h5>

                                    </div>
                                </div>
                                <div class="col-md-6">
                                    <article class="video-item">
                                        <div class="video-caption">
                                            <h5> <vm>Коротко о таблицах</vm> </h5>
                                        </div>
                                        <figure>
                                            <a href="https://www.youtube.com/watch?v=BYnpSIdqXt8" class="play"><img src="assets/images/main-thumb.png"></a>
                                        </figure>
                                    </article>
                                </div>
                            </div>
                        </div>
                    </section>


<section class="section video" data-section="section5">
    <div class="container">
        <div class="row">
            <div class="left-content">
                <h4><em>Что такое таблица?</em></h4>
                <h5> Таблица - это структурированный набор данных, состоящий из строк и столбцов (табличных данных). Таблицы позволяют быстро и легко посмотреть значения, показывающие некоторую взаимосвязь между различными типами данных, например - человек и его возраст, или расписание в плавательном бассейне.<h5>
                    <img src="assets/images/start8.png">
                        <h5>Смысл таблицы в том, что она жёсткая. Информацию легко интерпретировать, визуально сопоставляя заголовки строк и столбцов. Например, посмотрите на приведённую ниже таблицу и найдите единственное личное местоимение, используемое в третьем лице , с полом ♀, выступающее в качестве объекта в предложении. Ответ можно найти, сопоставив соответствующие заголовки столбцов и строк.<h5>
                            <img src="assets/images/start9.png">
                                <h5>Исходный код HTML <a href=https://github.com/mdn/learning-area/blob/main/html/tables/basic/personal-pronouns.html target="_blank">(HTML source code)</a> вышеприведённой таблице есть в GitHub; посмотрите его и живой пример <a href=https://mdn.github.io/learning-area/html/tables/basic/personal-pronouns.html target="_blank">(look at the live example)</a> ! Вы заметите, что таблица там выглядит иначе — это потому, что на сайте MDN к этим данным была применена таблица стилей, а приведённый в GitHub пример информации о стиле не имеет.<h5>
                                    <h4><pm>Когда не надо использовать таблицы HTML?</pm></h4>
                                    <h5>HTML-таблицы следует использовать для табличных данных — это то, для чего они предназначены. К сожалению, многие используют таблицы HTML для оформления веб-страниц, например, одна строка для заголовка, одна для содержимого, одна для сносок, и тому подобное.Это происходило из-за плохой поддержки CSS в разных браузерах; в наше время такое встречается гораздо реже, но иногда всё же попадается.<h5>
                                        <h5>Итак, мы уже достаточно говорили о теории, теперь возьмём конкретный пример и построим таблицу.<h5>
                                            <h5>1. Прежде всего, создайте локальную копию <a href=https://github.com/mdn/learning-area/blob/main/html/tables/basic/blank-template.html target="_blank">blank-template.html</a> и <a href=https://github.com/mdn/learning-area/blob/main/html/tables/basic/minimal-table.css target="_blank">minimal-table.css</a> в новой папке на вашем компьютере.<h5>
                                                <h5>2. Содержимое любой таблицы заключается между двумя тегами : <table></table>. Добавьте их в тело HTML.<h5>
                                                    <h5>3. Самым маленьким контейнером в таблице является ячейка, она создаётся элементом &lt;td> ('td' - сокращение от 'table data'). Введите внутри тегов table следующее:
                                                        <code>&lt;td>Hi, I'm your first cell.&lt;/td></code><h5>
                                                        <h5>4. Чтобы получить строку из четырёх ячеек, необходимо скопировать эти теги три раза.<h5>
                                                            <h5>Как видите, ячейки не располагаются одна под другой, на самом деле они автоматически выравниваются по отношению к другим ячейкам той же строки. Каждый элемент &lt;td> создаёт отдельную ячейку, а все вместе они создают первую строку. Каждая добавленная ячейка удлиняет эту строку.<h5>
                                                                <h5>Чтобы эта строка перестала расти, а новые ячейки перешли на вторую строку, необходимо использовать элемент &lt;tr> ('tr' - сокращение от 'table row').В результате получится таблица, которая будет выглядеть примерно так:<h5>
                                                                    <img src="assets/images/start10.png">
                                                                    <h4><pm>Что такое таблица?</pm></h4>
                                                                    <h5>Теперь обратимся к табличным заголовкам — особым ячейкам, которые идут вначале строки или столбца и определяют тип данных, которые содержит данная строка или столбец (как "Person" и "Age" в первом примере данной статьи). Проблема в том, что, хотя вы и можете представить, о чем идёт речь, ссылаться на эти данные не так легко, как хотелось бы. Лучше, чтобы строка и столбец с заголовками как-то выделялись.<h5>
                                                                        <h4><pm>Слияние нескольких строк или столбцов</pm></h4>
                                                                        <h5>Иногда нам нужно, чтобы ячейки распространялись на несколько строк или столбцов. Возьмём простой пример, в котором приведены имена животных. Иногда бывает нужно вывести имена людей рядом с именами животных. А иногда это не требуется, и тогда мы хотим, чтобы имя животного занимало всю ширину.<h5>
                                                                            <h5> К счастью, табличные заголовки и ячейки имеют атрибуты colspan и rowspan, которые позволяют это сделать. Оба принимают безразмерное числовое значение, которое равно количеству строк или столбцов, на которые должны распространяться ячейки. Например, colspan="2" распространяет ячейку на два столбца.<h5>
                                                                                <h5>И последняя возможность, о которой рассказывается в данной статье. HTML позволяет указать, какой стиль нужно применять к целому столбцу данных сразу — для этого применяют элементы &lt;col> и &lt;colgroup>. Их ввели, поскольку задавать стиль для каждой ячейки в отдельности или использовать сложный селектор вроде :nth-child() (en-US) было бы слишком утомительно.<h5>
                                                                                    <h4><pm>Добавление заголовка к таблице с помощью &lt;caption></pm></h4>
                                                                                    <h5>Вы можете добавить заголовок для таблицы установив его в элементе &lt;caption> и этот элемент необходимо поместить внутрь элемента &lt;table> (en-US). Причём вам нужно поместить его сразу после открытия тега &lt;table>.<h5>
                                                                                        <h5>Как можно понять из короткого примера выше, заголовок отражает в себе описание контента таблицы. Это полезно для всех читателей просматривающих страницу и желающих получить краткое представление от том полезна ли для них таблица, что особенно важно для слепых пользователей. Вместо того чтобы читать содержимое множества ячеек чтобы понять о чем таблица, он или она могут полагаться на заголовок и принимать решение читать ли таблицу более подробно.<h5>
                                                                                            <h4><pm>Добавление структуры с помощью &lt;thead>, &lt;tfoot> и &lt;tbody></pm></h4>
                                                                                            <h5>Когда таблицы становятся более сложными по структуре полезно дать им более структурированное определение. Отличный способ сделать это используя &lt;thead> (en-US), &lt;tfoot> и &lt;tbody> (en-US), которые позволяют вам разметить header, footer и body секции таблицы.<h5>
                                                                                                <h5>Эти элементы не создают дополнительной доступности для пользователей со скринридерами и не приводят к какому-то визуальному улучшению при их использовании. Зато они очень полезны при стилизации и разметке, как точки для добавления CSS к вашей таблице. Вот несколько интересных примеров, в случае длинной таблицы вы можете сделать header и footer таблицы повторяемый на каждой печатной странице, или вы можете сделать body таблицы отображаемое на одной странице и иметь доступ ко всему содержимому контенту прокручивая вверх и вниз.<h5>
                                                                                                    <h5>- Элементом &lt;thead> нужно обернуть часть таблицы которая относится к заголовку — обычно это первая строка содержащая заголовки колонок, но это не обязательно всегда такой случай. Если вы используете &lt;col>/&lt;colgroup> (en-US) элемент, тогда заголовок должен находиться ниже его.<h5>
                                                                                                        <h5>- Элементом &lt;tfoot> нужно обернуть ту часть, которая относится к footer таблицы — например, это может быть последняя строка в которой отражаются суммы по столбцам таблицы. Вы можете включить сюда footer таблицы, как и следовало ожидать, или чуть ниже заголовка таблицы (браузер всё равно отобразит его внизу таблицы).<h5>
                                                                                                            <h5>- Элементом &lt;tbody> необходимо обернуть остальную часть содержимого таблицы которая не находится в header или footer таблицы. Этот блок располагают ниже заголовка таблицы или иногда footer таблицы, зависит от того какую структуру вы решите использовать (читать выше по тексту).<h5>



            </div>
        </div>
    </div>
</section>




<section class="section video" data-section="section5">
    <div class="container">
        <div class="row">
                <div class="left-content">
                    <h4><em>Вы дошли до конца поздравляю!</em></h4>
                    <h4><em>Если вы всё же не смогли понять, что такое HTML предлагаю ознакомиться с видео ниже.</em></h4>

                    <div class="col-md-6" >
                        <article class="video-item">
                            <div class="video-caption">
                                <h5> <vm>Ответ на долгожданный вопрос</vm> </h5>
                            </div>
                            <figure>
                                <a href="https://www.youtube.com/watch?v=8mK5aY5YOCc&list=PLY4rE9dstrJyeZlPWoKJr1xKVVnG4w-Hc" class="play"><img src="assets/images/main-thumb.png"></a>
                            </figure>
                        </article>
                    </div>

                </div>

        </div>
    </div>
</section>












<!-- Scripts -->
<!-- Bootstrap core JavaScript -->
<script src="vendor/jquery/jquery.min.js"></script>
<script src="vendor/bootstrap/js/bootstrap.bundle.min.js"></script>

<script src="assets/js/isotope.min.js"></script>
<script src="assets/js/owl-carousel.js"></script>
<script src="assets/js/lightbox.js"></script>
<script src="assets/js/tabs.js"></script>
<script src="assets/js/video.js"></script>
<script src="assets/js/slick-slider.js"></script>
<script src="assets/js/custom.js"></script>

</body>
</html>